In [2]:
import pandas as pd
import os
origin = '../data/CompleteData/'
files = os.listdir(origin)
for file in files:
    print('File:',file)
    filepath = origin+file
    df = pd.read_csv(filepath, encoding='iso-8859-1',nrows=1)
    print('Fields:',list(df.columns))
    print('')
    print('===============================================')
    print('')

In [1]:
import pandas as pd

In [32]:
df1=  pd.DataFrame({
    'Name': ['Asim', 'Ali', 'Iqra'],
    'Age': [25,28,21],
    'Exp': [2,3,5],
    'Status': [1,0,1]
})

In [33]:
df2=  pd.DataFrame({
    'Name': ['Hammad', 'Waqar', 'Ali', 'Ali'],
    'Age': [71,58,28, 23],
    'Exp': [2,7,3,3],
    'Status': [1,0,1,1]
})

In [34]:
df1

   Name  Age  Exp  Status
0  Asim   25    2       1
1   Ali   28    3       0
2  Iqra   21    5       1

In [35]:
df2

     Name  Age  Exp  Status
0  Hammad   71    2       1
1   Waqar   58    7       0
2     Ali   28    3       1
3     Ali   23    3       1

In [57]:
pd.merge(df1, df2, how='outer', on=['Name'])

     Name  Age_x  Exp_x  Status_x  Age_y  Exp_y  Status_y
0    Asim   25.0    2.0       1.0    NaN    NaN       NaN
1     Ali   28.0    3.0       0.0   28.0    3.0       1.0
2     Ali   28.0    3.0       0.0   23.0    3.0       1.0
3    Iqra   21.0    5.0       1.0    NaN    NaN       NaN
4  Hammad    NaN    NaN       NaN   71.0    2.0       1.0
5   Waqar    NaN    NaN       NaN   58.0    7.0       0.0

In [61]:
pd.merge(df1, df2, how='outer', on=['Name', 'Age', 'Exp'])

     Name  Age  Exp  Status_x  Status_y
0    Asim   25    2       1.0       NaN
1     Ali   28    3       0.0       1.0
2    Iqra   21    5       1.0       NaN
3  Hammad   71    2       NaN       1.0
4   Waqar   58    7       NaN       0.0
5     Ali   23    3       NaN       1.0